![](https://snag.gy/h9Xwf1.jpg)

<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

## Introduction to `pandas`

_Authors: Tim Book_

---

`pandas` is the most popular python package for managing datasets and is used extensively by data scientists.

### Learning Objectives

- Define the anatomy of DataFrames.
- Explore data with DataFrames.
- Practice plotting with pandas.

### Lesson Guide

- What is `pandas`?
- Reading data
- Exploring data
    - Filtering
    - Sorting
- Split-Apply-Combine
- Missing Values

<a id='introduction'></a>

### What is `pandas`?

---

- Data analysis library - **Panel data system** (doesn't actually have to do with the animal, sorry).
- Created by Wes McKinney and Open Sourced by AQR Capital Management, LLC 2009.
- Implemented in highly optimized Python/Cython.
- Most ubiquitous tool used to start data analysis projects within the Python scientific ecosystem.

### Pandas Use Cases

---

- Cleaning data / Munging
- Exploratory Data Analysis (EDA)
- Structuring data for plots or tabular display
- Joining disparate sources
- Filtering, extracting, or transforming

## Importing the Dynamic Trio
From here on out, we'll begin pretty much all of our notebooks with the following three imports.

* **pandas**: The library we'll be using to do pretty much all data manipulation.
* **numpy**: The library we'll need to do various other computations. Even if you don't think you'll need it to start, you'll probably end up using it later.
* **matplotlib**: The library we'll use most for plotting. More on this another day.

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### Discussion: Where do you think a data scientist spends most of their time?

`/poll "Where do you think a data scientist spends most of their time?" "Moving data" "Cleaning data" "Exploring data" "Plotting data" "Predictive modeling" anonymous limit 1`

<a id='loading_csvs'></a>

### Loading a csv into a DataFrame

---

Pandas can load many types of files, but one of the most common filetypes for storing data is in a ```.csv``` file. Let's load a dataset on drug use by age from the ```./datasets``` directory:

In [3]:
ufo = pd.read_csv('datasets/ufo.csv')

In [4]:
type(ufo)

pandas.core.frame.DataFrame

This creates a pandas object called a **DataFrame**. These are powerful containers for data with many built-in functions to explore and manipulate data.

We will barely scratch the surface of DataFrame functionality in this lesson, but over the course of this class you will become an expert at using them.

<a id='exploring_data'></a>

## Exploratory Data Analysis (EDA) with Python!

---

DataFrames come with built-in functionality that makes data exploration easy. 

Let's start by looking at the "head" of your data with the `.head()` built-in function. If run alone in a notebook cell, it will show you the first and last handful of columns and the first 5 rows.

In [8]:
ufo.head(20)

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
5,Valley City,NaN,DISK,ND,9/15/1934 15:30
6,Crater Lake,NaN,CIRCLE,CA,6/15/1935 0:00
7,Alma,NaN,DISK,MI,7/15/1936 0:00
8,Eklutna,NaN,CIGAR,AK,10/15/1936 17:00
9,Hubbard,NaN,CYLINDER,OR,6/15/1937 0:00
10,Fontana,NaN,LIGHT,CA,8/15/1937 21:00
11,Waterloo,NaN,FIREBALL,AL,6/1/1939 20:00
12,Belton,RED,SPHERE,SC,6/30/1939 20:00
13,Keokuk,NaN,OVAL,IA,7/7/1939 2:00
14,Ludington,NaN,DISK,MI,6/1/1941 13:00
15,Forest Home,NaN,CIRCLE,CA,7/2/1941 11:30
16,Los Angeles,NaN,NaN,CA,2/25/1942 0:00
17,Hapeville,NaN,NaN,GA,6/1/1942 22:30
18,Oneida,NaN,RECTANGLE,TN,7/15/1942 1:00
19,Bering Sea,RED,OTHER,AK,4/30/1943 23:00

If we want to see the last part of our data, we can equivalently use the ```.tail()``` function.

<a id='data_dimensions'></a>

### Data dimensions

---

It's good to look at what the dimensions of your data are. The ```.shape``` property will tell you the rows and colum counts of your DataFrame.

In [12]:
ufo.shape[0]

80543

`/poll "In terms of rows, is this the largest dataset you've ever worked with?" "Yes" "No" "Not sure, but I'm not impressed anyway" anonymous limit 1`

You will notice that this is operates the same as `.shape` for numpy arrays/matricies. Pandas makes use of numpy under the hood for optimization and speed.

Look at the names of your columns with the ```.columns``` property.

In [13]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

Accessing a specific column is easy. You can use the bracket syntax just like python dictionaries with the string name of the column to extract that column.

In [18]:
ufo['City'].shape

(80543,)

In [ ]:
# Try to refrain from doing this...
# THREAD: Why shouldn't you rely on this? (There are several good reasons).

As you can see we can also use the ```.head()``` function on a single column, which is represented as a pandas Series object.

You can also access a column (as a DataFrame instead of a Series) or multiple columns with a list of strings.

In [ ]:
ufo.head()

<a id='dataframe_series'></a>

### DataFrame vs. Series

---

We've been playing with them, so I guess we should define them formally:

* A **`Series`** is a one-dimensional array of values **with an index**.
* A **`DataFrame`** is a two-dimensional array of values **with both a row and column index**.
* It turns out - each column of a `DataFrame` is actually a `Series`!

![](./assets/series-vs-df.png)

There is an important difference between using a list of strings and just a string with a column's name: when you use a list with the string it returns another **DataFrame**, but when you use just the string it returns a pandas **Series** object.

In [19]:
print(type(ufo['City']))
print(type(ufo[['City']]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

<a id='info'></a>

### Examining your data with `.info()`

---

The `.info()` should be the first thing you look at when getting acquainted with a new dataset.

**Types** are very important.  They impact the way data will be represented in our machine learning models, how data can be joined, whether or not math operators can be applied, and when you can encounter unexpected results.

> _Typical problems when working with new datasets_:
> - Missing values
> - Unexpected types (string/object instead of int/float)
> - Dirty data (commas, dollar signs, unexpected characters, etc)
> - Blank values that are actually "non-null" or single white-space characters

`.info()` is a function that is available on every **DataFrame** object. It gives you information about:

- Name of column / variable attribute
- Type of index (RangeIndex is default)
- Count of non-null values by column / attribute
- Type of data contained in column / attribute
- Unqiue counts of dtypes (Pandas data types)
- Memory usage of our dataset

In [20]:
ufo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80543 entries, 0 to 80542
Data columns (total 5 columns):
City               80496 non-null object
Colors Reported    17034 non-null object
Shape Reported     72141 non-null object
State              80543 non-null object
Time               80543 non-null object
dtypes: object(5)
memory usage: 3.1+ MB

## Aside:  Working with "Big Data"

---

The term **Big Data** has become a little bit of a buzzword with no clear, consensus definition. The most common definition is that **Big Data are data that are too big to fit in your computer's memory.**

![](https://snag.gy/UGNamo.jpg)

The reason that this definition is good is because when your data size exceeds your RAM, you have to use a separate set of tools to solve your problems. For example:

* Spark (Week 7!)
* Hadoop
* Being clever with how you read and use data
    - Separate it into small chunks for example.

<a id='describe'></a>

## Quick Summaries

---

The `.describe()` function is very useful for taking a quick look at your data. It gives you some of the basic descriptive statistics.

You can use `.value_counts()` to get a good tabular view of a categorical variable.

In [ ]:
# Let's read in the diamonds data set.

In [33]:
# Let's describe the price
ufo.describe()

           City Colors Reported Shape Reported  State            Time
count     80496           17034          72141  80543           80543
unique    13504              31             27     52           68901
top     Seattle          ORANGE          LIGHT     CA  7/4/2014 22:00
freq        646            5216          16332  10743              45

In [ ]:
# We can even do it to the whole DataFrame - what does that look like?
# What's missing?

In [ ]:
# Let's count up the cuts

In [ ]:
# Let's do the same thing, but normalized

```.describe()``` gives us these statistics:

- **count**, which is equivalent to the number of cells (rows)
- **mean**, the average of the values in the column
- **std**, which is the standard deviation
- **min**, the minimum value
- **25%**, the 25th percentile of the values 
- **50%**, the 50th percentile of the values, which is the equivalent to the median
- **75%**, the 75th percentile of the values
- **max**, the maximum value

There are built-in math functions that will work on all of the columns of a DataFrame at once, or subsets of the data.

I can use the ```.mean()``` function on the ```drug``` DataFrame to get the mean for every column.

<a id='independent_practice'></a>

### Now you!

---

Now that we know a little bit about basic DataFrame use, let's practice on a new dataset.

> Pro tip:  You can use the "tab" key to browse filesystem resources when your cursor is in a string to get a relative reference to the files that can be loaded in Jupyter notebook.  Remember, you have to use your arrow keys to navigate the files populated in the UI. 

<img src="https://snag.gy/IlLNm9.jpg">

1. Read in the `cars.csv` dataset. (call it `cars`)
1. What is the mean `mpg` for cars in this dataset?

In [ ]:
cars_pth = "../2.01-2.02-intro-to-pandas/datasets/cars.csv"

In [34]:
cars_pth = "../2.01-2.02-intro-to-pandas/datasets/cars.csv"

In [35]:
cars = pd.read_csv(cars_pth)

In [36]:
cars.columns

Index(['mpg', 'cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs', 'am', 'gear',
       'carb'],
      dtype='object')

In [37]:
cars.shape

(32, 11)

In [38]:
cars.describe()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
count,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.0000
mean,20.090625,6.187500,230.721875,146.687500,3.596563,3.217250,17.848750,0.437500,0.406250,3.687500,2.8125
std,6.026948,1.785922,123.938694,68.562868,0.534679,0.978457,1.786943,0.504016,0.498991,0.737804,1.6152
min,10.400000,4.000000,71.100000,52.000000,2.760000,1.513000,14.500000,0.000000,0.000000,3.000000,1.0000
25%,15.425000,4.000000,120.825000,96.500000,3.080000,2.581250,16.892500,0.000000,0.000000,3.000000,2.0000
50%,19.200000,6.000000,196.300000,123.000000,3.695000,3.325000,17.710000,0.000000,0.000000,4.000000,2.0000
75%,22.800000,8.000000,326.000000,180.000000,3.920000,3.610000,18.900000,1.000000,1.000000,4.000000,4.0000
max,33.900000,8.000000,472.000000,335.000000,4.930000,5.424000,22.900000,1.000000,1.000000,5.000000,8.0000

## Filtering
We usually don't need to operate on the _whole_ dataset. A very common task is to parse it down to only the pieces we need.

In [ ]:
cars.head()

In [39]:
v = np.array([12, 98, 9, 50, 23])

In [40]:
# What do you think the result of this cell is?
v[[True, False, True, False, True]]

array([12,  9, 23])

In [43]:
# How about this?
v < 40

array([ True, False,  True, False,  True])

In [ ]:
# So...
v[v < 40]

In [44]:
# And this?
cars['mpg'] > 30

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17     True
18     True
19     True
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27     True
28    False
29    False
30    False
31    False
Name: mpg, dtype: bool

In [45]:
# Finally...
cars[cars['mpg'] > 30]

     mpg  cyl  disp   hp  drat     wt   qsec  vs  am  gear  carb
17  32.4    4  78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4  75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4  71.1   65  4.22  1.835  19.90   1   1     4     1
27  30.4    4  95.1  113  3.77  1.513  16.90   1   1     5     2

Filtering in pandas uses vectors of booleans to describe inclusion or exclusion. `True` means you're in, `False` means you're out.

In [ ]:
# This functions identically to the code above, and can sometimes feels a little cleaner.
# Variables that serve this function are sometimes called "masks"

### Multiple Filters
Often we want to filter based on multiple conditions. We can use the usual "and" and "or" logic, but the symbols change for mystical (read: annoying) Python reasons.

In [58]:
cars[cars['cyl']>4]

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0   21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1   21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
3   21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4   18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2
5   18.1    6  225.0  105  2.76  3.460  20.22   1   0     3     1
6   14.3    8  360.0  245  3.21  3.570  15.84   0   0     3     4
9   19.2    6  167.6  123  3.92  3.440  18.30   1   0     4     4
10  17.8    6  167.6  123  3.92  3.440  18.90   1   0     4     4
11  16.4    8  275.8  180  3.07  4.070  17.40   0   0     3     3
12  17.3    8  275.8  180  3.07  3.730  17.60   0   0     3     3
13  15.2    8  275.8  180  3.07  3.780  18.00   0   0     3     3
14  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3     4
15  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3     4
16  14.7    8  440.0  230  3.23  5.345  17.42   0   0     3     4
21  15.5    8  318.0  150  2.76  3.520  16.87   0   0     3     2
22  15.2    8  304.0  150  3.15  3.435  17.30   0   0     3     2
23  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3     4
24  19.2    8  400.0  175  3.08  3.845  17.05   0   0     3     2
28  15.8    8  351.0  264  4.22  3.170  14.50   0   1     5     4
29  19.7    6  145.0  175  3.62  2.770  15.50   0   1     5     6
30  15.0    8  301.0  335  3.54  3.570  14.60   0   1     5     8

In [56]:
# "And" logic - use ampersand (&)
# Note parentheses mandatory!
cars[(cars['mpg']>30) & (cars['cyl']>4)]

Empty DataFrame
Columns: [mpg, cyl, disp, hp, drat, wt, qsec, vs, am, gear, carb]
Index: []

In [ ]:
# "Or" logic - use pipe (|)

### Now you:

In [ ]:
# (THREAD): Show me all the UFO sightings in your hometown! (City and State)
# Anything interesting?

### Aside: Some shortcuts

In [59]:
cars[cars['mpg'].between(24, 30)]

     mpg  cyl   disp  hp  drat     wt  qsec  vs  am  gear  carb
7   24.4    4  146.7  62  3.69  3.190  20.0   1   0     4     2
25  27.3    4   79.0  66  4.08  1.935  18.9   1   1     4     1
26  26.0    4  120.3  91  4.43  2.140  16.7   0   1     5     2

In [60]:
cars[~cars['mpg'].between(14, 31)]

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
14  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3     4
15  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3     4
17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
23  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3     4

In [ ]:
ufo[ufo['City'].isin(['Towaco', 'Montville'])]

<a id='indexing'></a>

## Pandas Indexing: `.loc` and `.iloc`

---

So far we've learned how to select both rows and columns. The savvy and skeptical student would have noticed a problem here. We have ambiguous notation! What does this do:

```python
data[something]
```

We can't tell! Is `something` a mask or a string? One selects rows, the other selects columns. **What if we wanted to filter rows and select columns at the same time?!**

Pandas has two properties that you can use for indexing:

- **`.loc`** indexes with the _labels_ for rows and columns axis.
- **`.iloc`** indexes with the _integer positions_ for rows and columns axis.
> There used to be a third, `.ix` which is now deprecated and shan't ever be used again.

## `.loc` is Most Common
The syntax of `.loc` is pretty intuitive:

```python
data.loc[rows, columns]
```

Where `rows` is often a filter (ie, a **mask**), and `columns` is a list of columns, or even just `:` to select all columns.

In [76]:
cars.loc[:5,['hp']]

    hp
0  110
1  110
2   93
3  110
4  175
5  105

In [73]:
cars.iloc[:5, :2]

    mpg  cyl
0  21.0    6
1  21.0    6
2  22.8    4
3  21.4    6
4  18.7    8

In [74]:
cars.columns

Index(['mpg', 'cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs', 'am', 'gear',
       'carb'],
      dtype='object')

### Acccctually.....
![](assets/actually.png)
According to **_The Zen of Python_**, explicit is better than implicit. `.loc` is explicit. **Most people choose to always use `.loc` instead of the ambiguous `data[something]` notation! This is a pretty good idea! When in doubt, use `.loc`!**

### `.iloc` is rare, but useful
The `i` stands for "integer" and will give you the actual zero-indexed numerical indices.

## Sorting

In [ ]:
# We can sort individual Series...

In [ ]:
# Or the entire DataFrame

### Now You:

In [79]:
ufo['Time_2'] = pd.to_datetime(ufo.Time)

In [80]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Time_2
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,1933-04-18 19:00:00

In [88]:
# Give me the 5 most recent UFO sightings in Roswell, New Mexico.
# You'll need to filter and use .sort_values()
# This is a hard one!
ufo[ufo.City=='Roswell']

,City,Colors Reported,Shape Reported,State,Time,Time_2
40,Roswell,NaN,SPHERE,NM,12/15/1945 2:00,1945-12-15 02:00:00
71,Roswell,NaN,NaN,NM,7/7/1947 0:00,1947-07-07 00:00:00
73,Roswell,NaN,NaN,NM,7/11/1947 0:00,1947-07-11 00:00:00
120,Roswell,RED,NaN,NM,3/22/1950 0:00,1950-03-22 00:00:00
233,Roswell,NaN,NaN,NM,6/15/1953 0:00,1953-06-15 00:00:00
562,Roswell,NaN,NaN,NM,8/15/1959 15:00,1959-08-15 15:00:00
4472,Roswell,NaN,NaN,NM,12/1/1980 0:01,1980-12-01 00:01:00
5941,Roswell,NaN,DISK,NM,9/1/1988 17:30,1988-09-01 17:30:00
6087,Roswell,NaN,NaN,NM,6/1/1989 23:00,1989-06-01 23:00:00
6166,Roswell,NaN,NaN,GA,9/1/1989 0:00,1989-09-01 00:00:00
10406,Roswell,NaN,CIRCLE,NM,6/17/1997 4:55,1997-06-17 04:55:00
11308,Roswell,NaN,TRIANGLE,NM,3/15/1998 0:00,1998-03-15 00:00:00
12097,Roswell,NaN,DIAMOND,NM,9/11/1998 0:00,1998-09-11 00:00:00
17374,Roswell,NaN,NaN,NM,9/10/2000 1:11,2000-09-10 01:11:00
18088,Roswell,NaN,TRIANGLE,NM,12/6/2000 18:16,2000-12-06 18:16:00
19752,Roswell,NaN,CHEVRON,NM,7/18/2001 21:00,2001-07-18 21:00:00
20055,Roswell,NaN,TRIANGLE,NM,8/15/2001 22:00,2001-08-15 22:00:00
20214,Roswell,NaN,FORMATION,GA,9/1/2001 1:31,2001-09-01 01:31:00
20737,Roswell,NaN,NaN,NM,10/31/2001 20:00,2001-10-31 20:00:00
21122,Roswell,NaN,SPHERE,GA,12/23/2001 21:30,2001-12-23 21:30:00
21212,Roswell,NaN,NaN,NM,1/7/2002 21:10,2002-01-07 21:10:00
22694,Roswell,RED GREEN,OVAL,NM,7/31/2002 4:24,2002-07-31 04:24:00
23103,Roswell,NaN,NaN,NM,9/3/2002 22:00,2002-09-03 22:00:00
26869,Roswell,NaN,FLASH,NM,10/31/2003 2:00,2003-10-31 02:00:00
28089,Roswell,NaN,VARIOUS,NM,2/29/2004 19:30,2004-02-29 19:30:00
28850,Roswell,NaN,LIGHT,NM,5/13/2004 21:00,2004-05-13 21:00:00
29882,Roswell,NaN,DISK,NM,8/15/2004 0:16,2004-08-15 00:16:00
33100,Roswell,NaN,DISK,NM,7/4/2005 11:00,2005-07-04 11:00:00
35290,Roswell,NaN,FLASH,NM,1/5/2006 18:45,2006-01-05 18:45:00
38298,Roswell,NaN,EGG,GA,11/28/2006 9:32,2006-11-28 09:32:00
40627,Roswell,NaN,OTHER,GA,7/9/2007 2:17,2007-07-09 02:17:00
41383,Roswell,NaN,VARIOUS,NM,9/5/2007 23:55,2007-09-05 23:55:00
43938,Roswell,BLUE,OVAL,NV,4/13/2008 19:30,2008-04-13 19:30:00
44261,Roswell,NaN,LIGHT,GA,5/5/2008 23:30,2008-05-05 23:30:00
44615,Roswell,NaN,NaN,NM,6/9/2008 0:00,2008-06-09 00:00:00
45502,Roswell,NaN,NaN,NM,8/4/2008 21:53,2008-08-04 21:53:00
45579,Roswell,NaN,LIGHT,NM,8/9/2008 19:03,2008-08-09 19:03:00
45995,Roswell,BLUE,VARIOUS,NM,9/15/2008 18:30,2008-09-15 18:30:00
46680,Roswell,NaN,SPHERE,GA,10/31/2008 21:00,2008-10-31 21:00:00
46734,Roswell,BLUE,LIGHT,GA,11/2/2008 23:03,2008-11-02 23:03:00
49122,Roswell,NaN,SPHERE,NM,6/10/2009 21:10,2009-06-10 21:10:00
49948,Roswell,ORANGE,LIGHT,NM,8/5/2009 20:45,2009-08-05 20:45:00
53568,Roswell,NaN,CIRCLE,GA,7/11/2010 1:00,2010-07-11 01:00:00
55799,Roswell,NaN,CYLINDER,GA,12/31/2010 23:25,2010-12-31 23:25:00
55978,Roswell,NaN,EGG,NM,1/16/2011 14:30,2011-01-16 14:30:00
57353,Roswell,NaN,CIRCLE,GA,6/15/2011 1:00,2011-06-15 01:00:00
58960,Roswell,NaN,LIGHT,NM,9/4/2011 19:50,2011-09-04 19:50:00
63970,Roswell,ORANGE,CIRCLE,GA,7/4/2012 18:30,2012-07-04 18:30:00
64782,Roswell,NaN,FIREBALL,GA,8/3/2012 21:45,2012-08-03 21:45:00
67040,Roswell,NaN,FLASH,NM,11/8/2012 22:30,2012-11-08 22:30:00
67331,Roswell,ORANGE,FIREBALL,GA,11/18/2012 21:05,2012-11-18 21:05:00
70379,Roswell,ORANGE,FIREBALL,GA,6/22/2013 21:00,2013-06-22 21:00:00
72530,Roswell,NaN,CIRCLE,GA,9/13/2013 22:50,2013-09-13 22:50:00
77613,Roswell,NaN,LIGHT,GA,5/14/2014 21:45,2014-05-14 21:45:00
80056,Roswell,NaN,OTHER,NM,8/18/2014 15:00,2014-08-18 15:00:00
80169,Roswell,BLUE,CIRCLE,GA,8/23/2014 0:00,2014-08-23 00:00:00
80459,Roswell,ORANGE,CIRCLE,NM,9/1/2014 20:00,2014-09-01 20:00:00

## Split-Apply-Combine

---

What if we want summary statistics _with respect to some categorical variable?_ For example, the price of a diamond probably varies widely between different diamond cuts. To tackle this problem, we'll use the **Split-Apply-Combine** technique. (This is sometimes called **MapReduce**, but is more of a special case of MapReduce). 

* **Split**: Separate your data into different DataFrames, one for each category.
* **Apply**: On each split-up DataFrame, apply some function or transformation (for example, the mean).
* **Combine**: Take the results and combine the split-up DataFrames back into one aggregate DataFrame.

This might sound complicated, but it's actually only two commands in pandas (the **Combine** step is done for us).

In [1]:
# What is the mean price by diamond cut?
diamond_pth = "datasets/diamonds.csv"

In [2]:
import pandas as pd
d_pd = pd.read_csv(diamond_pth)

In [7]:
d_pd.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [12]:
d_pd.groupby('cut')['price'].mean()

cut
Fair         4358.757764
Good         3928.864452
Ideal        3457.541970
Premium      4584.257704
Very Good    3981.759891
Name: price, dtype: float64

In [13]:
for k, v in d_pd.groupby('cut'):
    print(k)
    print(v['price'])
    #print("\n")

Fair
8         337
91       2757
97       2759
123      2762
124      2762
         ...
53757    2724
53800    2732
53863    2743
53879    2745
53882    2747
Name: price, Length: 1610, dtype: int64
Good
2         327
4         335
10        339
17        351
18        351
         ...
53913    2753
53914    2753
53916    2753
53927    2756
53936    2757
Name: price, Length: 4906, dtype: int64
Ideal
0         326
11        340
13        344
16        348
39        403
         ...
53925    2756
53926    2756
53929    2756
53935    2757
53939    2757
Name: price, Length: 21551, dtype: int64
Premium
1         326
3         334
12        342
14        345
15        345
         ...
53928    2756
53930    2756
53931    2756
53934    2757
53938    2757
Name: price, Length: 13791, dtype: int64
Very Good
5         336
6         336
7         337
9         338
19        351
         ...
53921    2755
53922    2755
53932    2757
53933    2757
53937    2757
Name: price, Length: 12082, dtype: int64

In [ ]:
# Can we just describe each price by cut?

In [ ]:
# What if I want my own recipe of statistics?

### Now You:
What is the mean miles per gallon for each cylinder size?

### Advanced Split-Apply-Combining
Feel free to skip!

In [ ]:
# What if I want my own home-spun aggregate function?

# Maybe the mean of the log-price is interesting to you?
def log_mean(p):
    return np.mean(np.log(p))

diamonds.groupby('cut')['price'].agg(['count', 'mean', log_mean])

In [ ]:
# What if I want functions of different columns?
diamonds.groupby('cut').agg({
    'price': {'count': 'count', 'price_mean': 'mean'},
    'carat': {'carat_mean': 'mean'}
})

## Adding, Dropping, Renaming, and `inplace` Methods

In [ ]:
# Adding a column is easy, just define it!
# What if I wanted km per gal instead of miles per gal?

In [ ]:
# Oops - that actually doesn't make sense since they'd be using liters anyway.
# Let's drop it.

In [ ]:
# But... it's not gone?

###  Inplace Methods!
There are several methods in pandas that don't "stick" unless you tell them to. These methods will always have `inplace=False` by default. If you want to run a method and have it "stick" - assign `inplace=True`.

For example...

### Renaming Columns

In [ ]:
# Yuck - I hate spaces and capital letters
ufo.head()

In [ ]:
# Lowercaseifying is easy:
# The "columns" attribute of a DataFrame works just like a numpy array or Series.

In [ ]:
# The .rename method

### Aside: `str` and `dt` methods
There are a lot of familiar string and date operations we can perform on columns. Strangely, they exist within a pandas submodule and so have to be prefixed with `str` and `dt` respectively.

In [ ]:
ufo['shape'].str.lower().head()

In [ ]:
ufo['shape'].str.replace('O', 'BRO').head()

In [ ]:
# We already did this above, but datetime variables need to be converted specially.
# ufo['time'] = pd.to_datetime(ufo['time'])
ufo['time'].dt.year.head()

## Missing Values

In [ ]:
s = pd.Series([5, 7, np.nan, 2, 10])

In [ ]:
s

In [ ]:
# Hmm...

In [ ]:
# Easy way to filter out missings!

## Exporting Data
We can read data, but how do we save it so we can send it out? pandas has several methods of the form `.to_*()`.

<a id='review'></a>

### Review

---

 - What would we do with a dataset when we first acquire it?
 - What's important to consider when first looking at a dataset? 
 - What are some common problems we can run into with new data?
 - What are some common operations with DataFrames?
 - How do we slice? Index? Filter?

# EXTRA MATERIALS
![](assets/biohazard.png)
Everything that follows is considered advanced or "too much" for our first session with pandas, and may not be explicitly covered by the instructor. If the instructor _does_ cover it, please don't worry that you don't understand this on your first pass.

**THAT DOES NOT MEAN THESE TOPICS ARE UNIMPORTANT OR RARELY USED!** We highly _highly_ recommend you take a look at these on your own time.

### Merging

In [ ]:
movies = pd.read_csv(
    'datasets/movies.tbl',
    sep='|',
    encoding='latin1',
    header=None,
    names=['movie_id', 'title'],
    usecols=[0, 1]
)
movies.head()

In [ ]:
ratings = pd.read_csv(
    'datasets/movie_ratings.tsv',
    sep='\t',
    header=None,
    names=['user_id', 'movie_id', 'rating', 'timestamp']
)
ratings.head()

In [ ]:
movie_reviews = pd.merge(ratings, movies, how='left')
movie_reviews.head()

In [ ]:
print(movies.shape)
print(ratings.shape)
print(movie_reviews.shape)

### "Categorical" Variables
Despite the name, when pandas says "Categorical", they really mean "Ordinal" - that is, ordered categories.

For example, check out the following crosstab:

In [ ]:
pd.crosstab(diamonds['cut'], diamonds['color'])

The "cuts" are not in the right order! They're actually in alphabetical order. We can fix this by telling pandas that there really is an important ordering here.

In [ ]:
diamonds['cut'] = pd.Categorical(diamonds['cut'], categories=['Fair', 'Good', 'Very Good', 'Premium', 'Ideal'])
pd.crosstab(diamonds['cut'], diamonds['color'])

### Categorizing with `.map()`

In [ ]:
cars['cyl_word'] = cars['cyl'].map({4: 'Four', 6: 'Six', 8: 'Eight'})
cars['cyl_word'].value_counts()

In [ ]:
def is_efficient(x):
    if x > 20:
        return "Efficient"
    else:
        return "Wasteful"
    
cars['fuel_economy'] = cars['mpg'].map(is_efficient)
cars['fuel_economy'].value_counts()

### Advanced Data Manipulation with `.apply()`
The `.apply()` method is very similar to `.map()`, except more advanced. You can apply a function along any axis of a `DataFrame`. `.apply()` is our "Swiss army knife" for data manipulation - if something can't be solved with ordinary means, it might be time for a `.apply()`.

In [ ]:
sizes = pd.Series([8, 4, 5, 'L', 2, 12, 16, 8, 'XL'])

In [ ]:
def to_num(x):
    try:
        out = float(x)
    except:
        out = np.nan
    return out

In [ ]:
sizes.apply(to_num)

In [ ]:
cars.head()

In [ ]:
def describe_car(row):
    efficiency = row['fuel_economy'].lower()
    cyl = row['cyl_word'].lower()
    auto = 'automatic' if row['am'] == 1 else 'manual'
    print(f"This {cyl} cylinder car has {auto} transmission and a(n) {efficiency} fuel economy.")

In [ ]:
cars.head().apply(describe_car, axis=1)

BONUS QUESTION: Why are there 5 "None" valus in the above output?